app/controllers/wikis_controller.rb

SELECT * FROM "wikis" WHERE ("wikis"."current" = 't') ORDER BY updated_at DESC
---
  def index
    @wikis = Wiki.find(:all, :conditions => {:current => true},:order => "updated_at DESC")

SELECT * FROM "wikis" WHERE ("wikis"."id" = 1)
---
  def show
    @wiki = Wiki.find(params[:id])

SELECT * FROM "wikis" WHERE ("wikis"."current" = 't') AND ("wikis"."title" = 'about-fabwiki') ORDER BY wikis.id DESC LIMIT 1
---
  def view
    @wiki = Wiki.find_last_by_title(params[:id],:conditions => {:current => true})

SELECT * FROM "wikis" WHERE ("wikis"."id" = 9)
---
  def history
    @wiki = Wiki.find(params[:id])

SELECT * FROM "wikis" WHERE ("wikis"."id" = 1)
---
  def edit
    @wiki = Wiki.find(params[:id])

SELECT "wikis".id FROM "wikis" WHERE ("wikis"."title" = 'Shopbot') LIMIT 1
INSERT INTO "wikis" ("created_at", "title", "author", "body", "notes", "current", "updated_at", "revision") VALUES('2012-05-26 17:09:19', 'about-fabwiki', 'jywarren', 'FabWiki is an extremely minimal wiki created by Jeff Warren (jeff@unterbahn.com) for collecting and archiving information about the Haystack FabLab, in the absence of web access.
---
  def create
    @wiki = Wiki.new(params[:wiki])
    @wiki = @wiki.new_revision(params[:wiki]) if Wiki.find_by_title(params[:wiki][:title])

    respond_to do |format|
      if @wiki.save

SELECT * FROM "wikis" WHERE ("wikis"."id" = 1)
---
  def update
    @wiki = Wiki.find(params[:id])

SELECT * FROM "wikis" WHERE ("wikis"."id" = 1)
DELETE FROM "wikis" WHERE "id" = 1
---
  def destroy
    @wiki = Wiki.find(params[:id])
    @wiki.destroy